{
    "sections": [
        {
            "label": "Movies/mics",
            "params": [
                {
                    "name": "do_raw",
                    "label": "Import raw movies/micrographs?",
                    "valueClass": "Boolean",
                    "paramClass": "BooleanParam",
                    "default": true,
                    "help": "Set this to Yes if you plan to import raw movies or micrographs"
                },
                {
                    "name": "fn_in_raw",
                    "label": "Raw input files:",
                    "valueClass": "String",
                    "paramClass": "StringParam",
                    "default": "Micrographs/*.tif",
                    "pattern": "Movie or Image (*.{mrc,mrcs,tif,tiff,eer,mrc.bz2,mrcs.bz2,mrc.zst,mrcs.zst,mrc.xz,mrcs.xz})",
                    "help": "Provide a Linux wildcard that selects all raw movies or micrographs to be imported. The path must be a relative path from the project directory. To import files outside the project directory, first make a symbolic link by an absolute path and then specify the link by a relative path. See the FAQ page on RELION wiki (https://www3.mrc-lmb.cam.ac.uk/relion/index.php/FAQs#What_is_the_right_way_to_import_files_outside_the_project_directory.3F) for details. To process compressed MRC movies, you need pbzip2, zstd and xz command in your PATH for bzip2, Zstandard and xzip compression, respectively."
                },
                {
                    "name": "is_multiframe",
                    "label": "Are these multi-frame movies?",
                    "valueClass": "Boolean",
                    "paramClass": "BooleanParam",
                    "help": "Set to Yes for multi-frame movies, set to No for single-frame micrographs."
                },
                {
                    "name": "optics_group_name",
                    "label": "Optics group name:",
                    "default": "opticsGroup1",
                    "help": "Name of this optics group. Each group of movies/micrographs with different optics characteristics for CTF refinement should have a unique name."
                },
                {
                    "name": "fn_mtf",
                    "label": "MTF of the detector:",
                    "pattern": "STAR Files (*.star)",
                    "default": ".",
                    "help": "As of release-3.1, the MTF of the detector is used in the refinement stages of refinement. If you know the MTF of your detector, provide it here. Curves for some well-known detectors may be downloaded from the RELION Wiki. Also see there for the exact format \n If you do not know the MTF of your detector and do not want to measure it, then by leaving this entry empty, you include the MTF of your detector in your overall estimated B-factor upon sharpening the map. Although that is probably slightly less accurate, the overall quality of your map will probably not suffer very much. \n \n Note that when combining data from different detectors, the differences between their MTFs can no longer be absorbed in a single B-factor, and providing the MTF here is important!"
                },
                {
                    "name": "angpix",
                    "label": "Pixel size (Angstrom):",
                    "help": "Pixel size in Angstroms. ",
                    "valueClass": "Float",
                    "paramClass": "FloatParam"
                },
                {
                    "name": "kV",
                    "label": "Voltage (kV):",
                    "help": "Voltage the microscope was operated on (in kV)",
                    "valueClass": "Float",
                    "paramClass": "FloatParam"
                },
                {
                    "name": "Cs",
                    "label": "Spherical aberration (mm):",
                    "default": 2.7,
                    "help": "Spherical aberration of the microscope used to collect these images (in mm). Typical values are 2.7 (FEI Titan & Talos, most JEOL CRYO-ARM), 2.0 (FEI Polara), 1.4 (some JEOL CRYO-ARM) and 0.01 (microscopes with a Cs corrector).",
                    "valueClass": "Float",
                    "paramClass": "FloatParam"
                },
                {
                    "name": "Q0",
                    "label": "Amplitude contrast:",
                    "default": 0.1,
                    "help": "Fraction of amplitude contrast. Often values around 10% work better than theoretically more accurate lower values...",
                    "valueClass": "Float",
                    "paramClass": "FloatParam"
                },
                {
                    "name": "beamtilt_x",
                    "label": "Beamtilt in X (mrad)",
                    "default": 0,
                    "help": "Known beamtilt in the X-direction (in mrad). Set to zero if unknown.",
                    "valueClass": "Float",
                    "paramClass": "FloatParam"
                },
                {
                    "name": "beamtilt_y",
                    "label": "Beamtilt in Y (mrad)",
                    "default": 0,
                    "help": "Known beamtilt in the X-direction (in mrad). Set to zero if unknown.",
                    "valueClass": "Float",
                    "paramClass": "FloatParam"
                }
            ]
        },
        {
            "label": "Others",
            "params": [
                {
                    "name": "do_other",
                    "label": "Import other node types?",
                    "default": false,
                    "valueClass": "Boolean",
                    "paramClass": "BooleanParam",
                    "help": "Set this to Yes  if you plan to import anything else than movies or micrographs"
                },
                {
                    "name": "fn_in_other",
                    "label": "Input file:",
                    "default": "ref.mrc",
                    "pattern": "Input file (*.*)",
                    "help": "Select any file(s) to import. \n \n Note that for importing coordinate files, one has to give a Linux wildcard, where the *-symbol is before the coordinate-file suffix, e.g. if the micrographs are called mic1.mrc and the coordinate files mic1.box or mic1_autopick.star, one HAS to give '*.box' or '*_autopick.star', respectively.\n \n Also note that micrographs, movies and coordinate files all need to be in the same directory (with the same rootnames, e.g.mic1 in the example above) in order to be imported correctly. 3D masks or references can be imported from anywhere. \n \n Note that movie-particle STAR files cannot be imported from a previous version of RELION, as the way movies are handled has changed in RELION-2.0. \n \n For the import of a particle, 2D references or micrograph STAR file or of a 3D reference or mask, only a single file can be imported at a time. \n \n Note that due to a bug in a fltk library, you cannot import from directories that contain a substring  of the current directory, e.g. dont important from /home/betagal if your current directory is called /home/betagal_r2. In this case, just change one of the directory names."
                },
                {
                    "name": "node_type",
                    "label": "Node type:",
                    "help": "Select the type of Node this is."
                },
                {
                    "name": "optics_group_particles",
                    "label": "Rename optics group for particles:",
                    "default": "ref.mrc",
                    "pattern": "Rename optics group for particles:",
                    "help": "Only for the import of a particles STAR file with a single, or no, optics groups defined: rename the optics group for the imported particles to this string."
                }
            ]
        }
    ]
}